tap "homebrew/cask-drivers"

brew "zsh"
brew "tmux"
brew "git"
brew "tree"
brew "wget"
brew "gpg"
brew "coreutils"
brew "go"
brew "k9s"
brew "gnupg"
brew "kubectx"
brew "fzf"
brew "jq"
brew "awscli"
brew "pre-commit"
brew "gcc"
brew "make"
brew "watch"
brew "delta"
brew "eza"
brew "bat"
brew "ripgrep"
brew "make"
brew "gh"
brew "stern"
brew "atuin"
brew "zoxide"
brew "dive"
brew "starship"
brew "gum"
brew "mise"

# Casks
cask "firefox"
cask "google-chrome"
cask "bitwarden"
cask "spotify"
cask "slack"
cask "signal"
cask "visual-studio-code"
cask "macfuse"
cask "iterm2"
cask "docker"
cask "logi-options+"
cask "discord"
cask "steam"
cask "rectangle"
cask "contexts"

# Fonts
cask "font-bitstream-vera-sans-mono-nerd-font"

# VS Code extensions
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
