tap "homebrew/cask-drivers"

brew "zsh"
brew "tmux"
brew "git"
brew "tree"
brew "wget"
brew "gpg"
brew "coreutils"
brew "go"
brew "python"
brew "node"
brew "k9s"
brew "gnupg"
brew "kubectx"
brew "fzf"
brew "jq"
brew "awscli"
brew "pre-commit"
brew "gcc"
brew "make"
brew "watch"
brew "delta"
brew "eza"
brew "bat"
brew "ripgrep"
brew "make"
brew "gh"
brew "stern"
brew "atuin"
brew "zoxide"
brew "dive"
brew "starship"
brew "gum"

# Casks
cask "firefox"
cask "google-chrome"
cask "bitwarden"
cask "spotify"
cask "slack"
cask "signal"
cask "visual-studio-code"
cask "macfuse"
cask "iterm2"
cask "docker"
cask "logi-options+"
cask "discord"
cask "steam"
cask "rectangle"
cask "contexts"

# Fonts
cask "font-bitstream-vera-sans-mono-nerd-font"
